Biplane_Wall_Functions/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.7 0 0);

boundaryField
{
   inlet
    {
	type            fixedValue;
    	value		uniform (1.7 0 0);
    }

   outlet
    {
        type            zeroGradient;
    }

   upperairfoil
    {
        type            noSlip;
    }

   lowerairfoil
    {
	type		noSlip;
    }

   front
    {
        type            empty;
    }

   back
    {
        type            empty;
    }
}

// ************************************************************************* //
